{
    "locations": [
        {
            "id": 0,
            "title": "Moeraki Boulders",
            "location": "Moeraki, Otago",
            "coords": [170.8300652, -45.3555993],
            "rating": 7,
            "imageUrl": "https://live.staticflickr.com/65535/51214777115_f36340b787_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "The Moeraki Boulders are a fascinating natural wonder located on Koekohe Beach in New Zealand. These gigantic spherical boulders, some measuring up to three meters in diameter, are scattered along the shoreline, creating a surreal and awe-inspiring sight. The smooth and rounded shapes of the boulders are a result of erosion over millions of years. Visitors can take a leisurely stroll along the beach, marveling at these unique geological formations and capturing memorable photographs of this picturesque spot.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 1,
            "title": "Dunedin Holiday Park & Motels",
            "location": "Dunedin, Otago",
            "coords": [170.83298005177244,-45.35390119449548],
            "rating": 5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 31.2,
            "description": "Dunedin Holiday Park & Motels offer comfortable and convenient accommodation options in the vibrant city of Dunedin. Situated amidst picturesque surroundings, this holiday park provides a range of facilities and services to ensure a pleasant stay for guests. From fully-equipped cabins and self-contained motels to powered camping sites, visitors can choose the option that suits their preferences. The park boasts amenities such as communal kitchens, BBQ areas, laundry facilities, and recreational activities, making it an ideal base for exploring the city's attractions, including the Otago Peninsula, Larnach Castle, and the vibrant city center.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 2,
            "title": "Baldwin Street",
            "location": "Dunedin, Otago",
            "coords": [170.51166896657878,-45.902226788976485],
            "rating": 8,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/en/9/9f/Baldwin_Street.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Baldwin Street, located in Dunedin, New Zealand, holds the remarkable distinction of being the steepest residential street in the world. Tourists and locals alike flock to this unique landmark to experience the thrill of ascending its extremely steep gradient. Walking up or down the street can be quite an adventure, as the slope can be challenging, but the effort is rewarded with stunning views of the city and an opportunity to conquer this extraordinary feat. Baldwin Street has become an iconic symbol of Dunedin and is often a must-visit destination for those seeking a memorable and exhilarating experience.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 3,
            "title": "Larnach Castle",
            "location": "Dunedin, Otago",
            "coords": [170.51166896657878,-45.902226788976485],
            "rating": 7,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/2c/Larnach_Castle.jpg",
            "imageAlt": "",
            "price": 39,
            "description": "Larnach Castle, nestled in the scenic Otago Peninsula near Dunedin, is a captivating architectural gem with a rich history. Built in the late 19th century, this imposing castle is renowned for its grandeur and exquisite craftsmanship. Visitors can explore the opulent interiors, including the ballroom, various themed bedrooms, and the stunning gardens that surround the castle. Larnach Castle also offers guided tours, allowing guests to delve into the captivating tales of its former inhabitants. With its stunning views of the harbor and its beautifully preserved Victorian charm, Larnach Castle offers a truly enchanting experience.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 4,
            "title": "Nugget Point Lighthouse",
            "location": "Nugget Point, Otago",
            "coords": [169.79441215, -46.4238629],
            "rating": 6.5,
            "imageUrl": "https://live.staticflickr.com/65535/52071785979_e238aac74a_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Perched atop a rugged coastal cliff on the South Island of New Zealand, Nugget Point Lighthouse offers breathtaking panoramic views of the Pacific Ocean and the surrounding rocky coastline. This iconic lighthouse is known for its picturesque location and the jagged rock formations that jut out of the sea, resembling golden nuggets, hence the name. Visitors can access the lighthouse via a short walk and witness the dramatic waves crashing against the cliffs. The viewing platform provides an ideal vantage point for observing wildlife, including fur seals and seabirds. Nugget Point Lighthouse is a popular destination for nature enthusiasts and photographers seeking awe-inspiring vistas.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 5,
            "title": "Purakaunui Falls",
            "location": "Purakaunui, Otago",
            "coords": [169.5961746, -46.50579],
            "rating": 3,
            "imageUrl": "https://live.staticflickr.com/5123/5371818357_b758bdc40e_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Tucked away in the lush Catlins Forest Park of New Zealand's South Island, Purakaunui Falls is a cascading waterfall that enchants visitors with its natural beauty. Surrounded by dense native forest, this three-tiered waterfall is a tranquil oasis, emanating a serene ambiance. A short walk through the verdant forest leads to a viewing platform, where visitors can marvel at the graceful flow of water and capture stunning photographs. The captivating beauty and seclusion of Purakaunui Falls make it a must-visit destination for those exploring the scenic wonders of the Catlins region.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 6,
            "title": "McLean Falls",
            "location": "Chaslands, Otago",
            "coords": [169.3555865, -46.5903857],
            "rating": 8.5,
            "imageUrl": "https://live.staticflickr.com/65535/48973502918_02a7c3fa04_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Nestled within the pristine wilderness of the Catlins Forest Park in New Zealand, McLean Falls is a hidden gem awaiting discovery. This stunning waterfall cascades over multiple tiers, creating a mesmerizing spectacle as the water tumbles down into a crystal-clear pool below. Surrounded by native bush and vibrant greenery, McLean Falls offers a tranquil escape into nature. Visitors can embark on a picturesque hike through the forest, following the well-maintained trail that leads to the falls. The serene atmosphere and awe-inspiring beauty of McLean Falls make it a true haven for nature enthusiasts and photographers.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 7,
            "title": "Beach Road Holiday Park",
            "location": "Invercargill, Southland",
            "coords": [168.260989, -46.434017],
            "rating": 4,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 15.3,
            "description": "Situated in a picturesque coastal setting, Beach Road Holiday Park offers a relaxing and idyllic retreat in New Zealand's North Island. Located near a pristine sandy beach, this holiday park provides a range of accommodation options to suit various preferences, from self-contained cabins to spacious powered camping sites. Guests can enjoy direct access to the beach, perfect for swimming, sunbathing, or taking leisurely walks along the shore. The park also offers amenities such as communal kitchens, BBQ areas, and a children's playground, ensuring a comfortable and enjoyable stay for all visitors.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 8,
            "title": "Lake Hauroko",
            "location": "Southland",
            "coords": [167.387139, -45.989489],
            "rating": 9,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/fb/Lake-Hauroko-pier.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Lake Hauroko, nestled in the remote and untouched Fiordland region of New Zealand's South Island, is a breathtaking natural wonder. Surrounded by lush forests and towering mountains, this deep and serene lake offers a peaceful escape into nature's tranquility. Visitors can embark on a scenic boat cruise to explore the lake's pristine waters, marvel at its reflective beauty, and immerse themselves in the surrounding wilderness. For those seeking adventure, Lake Hauroko also serves as the starting point for the challenging and rewarding South Coast Track, a multi-day hiking experience that showcases the region's raw and untouched beauty.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 9,
            "title": "Te Anau Top 10 Holiday Park",
            "location": "Te Anau, Southland",
            "coords": [167.719432, -45.415594],
            "rating": 2.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 101,
            "description": "Nestled on the shores of Lake Te Anau, Te Anau Top 10 Holiday Park offers a gateway to the stunning Fiordland region of New Zealand. This well-appointed holiday park provides a range of accommodation options, including self-contained units, cabins, and powered camping sites. Guests can relax and soak in the picturesque lake views or take advantage of the park's amenities, such as BBQ areas, communal kitchens, and a spa pool. With its convenient location and proximity to the natural wonders of Fiordland, Te Anau Top 10 Holiday Park is an ideal base for exploring attractions like Milford Sound and the Kepler Track.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 10,
            "title": "Milford Sound Cruise",
            "location": "Milford Sound, Southland",
            "coords": [167.926174, -44.672553],
            "rating": 10,
            "imageUrl": "https://live.staticflickr.com/65535/14303684115_77a92c1e80_b.jpg",
            "imageAlt": "",
            "price": 145,
            "description": "A Milford Sound Cruise is an unforgettable experience that allows visitors to immerse themselves in the breathtaking beauty of one of New Zealand's most iconic natural wonders. Located within Fiordland National Park, Milford Sound is a fiord renowned for its towering cliffs, cascading waterfalls, and pristine waters. During the cruise, guests can marvel at the sheer scale of the fiord's dramatic landscape, spot wildlife such as seals and dolphins, and witness the ethereal beauty of Stirling Falls and Mitre Peak. With knowledgeable guides providing insights into the area's geology and wildlife, a Milford Sound Cruise promises to be an awe-inspiring and immersive adventure.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 11,
            "title": "Queenstown Top 10 Holiday Park",
            "location": "Queenstown, Otago",
            "coords": [168.677546, -44.984458],
            "rating": 7,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 54,
            "description": "Nestled in the heart of Queenstown, known as the adventure capital of New Zealand, Queenstown Top 10 Holiday Park offers a convenient and comfortable accommodation option for travelers. The park features a range of well-equipped cabins, self-contained units, and powered camping sites to suit various preferences. Guests can relax in the tranquil setting, surrounded by stunning mountain vistas, or take a short stroll to explore the vibrant town center with its array of restaurants, shops, and adventure activities. Queenstown Top 10 Holiday Park serves as a perfect base for adrenaline seekers and nature lovers looking to experience the thrill and beauty of the region.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 12,
            "title": "Skyline Queenstown",
            "location": "Queenstown, Otago",
            "coords": [168.655931, -45.028561],
            "rating": 7.5,
            "imageUrl": "https://cdn.pixabay.com/photo/2013/07/18/14/52/skyline-luge-163934_1280.jpg",
            "imageAlt": "",
            "price": 75,
            "description": "Skyline Queenstown is a must-visit attraction that offers breathtaking panoramic views of the stunning Queenstown region from its lofty perch atop Bob's Peak. Visitors can reach the summit by taking the iconic Skyline Gondola, which provides a scenic ride offering incredible vistas along the way. At the top, an array of activities awaits, including the thrilling Luge ride, which allows guests to race down the winding tracks, and the Skyline Restaurant, where visitors can savor delicious cuisine while enjoying the mesmerizing views. Skyline Queenstown offers an unforgettable experience, combining adventure, natural beauty, and world-class dining.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 13,
            "title": "Shotover Jet",
            "location": "Queenstown, Otago",
            "coords": [168.67148, -44.98707],
            "rating": 1.5,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/82/Shotover_Jet%2C_Jet_Boating_the_Shotover_River_Canyons%2C_Queenstown%2C_New_Zealand.jpg",
            "imageAlt": "",
            "price": 159,
            "description": "For adrenaline junkies and thrill-seekers, a Shotover Jet experience in Queenstown is an absolute must. Shotover Jet takes passengers on a heart-pumping adventure through the narrow canyons of the Shotover River, showcasing the region's stunning natural beauty at high speeds. Skilled jet boat drivers navigate the winding river, performing thrilling spins and maneuvers that will leave passengers exhilarated and craving more. As the boat zips through the dramatic canyons, passengers are treated to close-up views of towering rock walls and pristine turquoise waters. Shotover Jet promises an adrenaline-fueled adventure that is sure to leave a lasting impression.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 14,
            "title": "Kawerau Bridge Zipride",
            "location": "Queenstown, Otago",
            "coords": [168.915346, -45.012218],
            "rating": 8,
            "imageUrl": "https://live.staticflickr.com/2052/2488557430_01dd672809_b.jpg",
            "imageAlt": "",
            "price": 30,
            "description": "The Kawerau Bridge Zipride offers an exhilarating and unique adventure in Queenstown, New Zealand. Suspended high above the stunning Kawarau River, this zipride provides an adrenaline-fueled experience as participants glide across the river on multiple ziplines. Riders can enjoy breathtaking views of the river, the surrounding mountains, and the iconic Kawarau Bungy Bridge as they soar through the air. Whether traveling solo or with friends, the Kawerau Bridge Zipride is a thrilling activity that combines the excitement of ziplining with the natural beauty of Queenstown's landscapes.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 15,
            "title": "Blue Pools",
            "location": "Wanaka, Otago",
            "coords": [169.2398764, -44.22496305],
            "rating": 3.5,
            "imageUrl": "https://live.staticflickr.com/4013/4674315045_1ce6327276_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Tucked away in the heart of Mount Aspiring National Park on the South Island of New Zealand, the Blue Pools offer a tranquil and mesmerizing natural attraction. Visitors can embark on a short walk through native beech forest, crossing suspension bridges that span the crystal-clear waters of the Makarora River. The pools derive their name from their strikingly vibrant blue hues, which are a result of the water's purity and the light reflecting off fine glacial silt. The Blue Pools provide an ideal spot for a refreshing dip or simply to marvel at the enchanting colors and serenity of this unspoiled wilderness.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 16,
            "title": "Lake's Edge Holiday Park",
            "location": "Lake Tekapo, Canterbury",
            "coords": [170.462777, -43.999194],
            "rating": 6,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 81,
            "description": "Nestled on the shores of a picturesque lake, Lake's Edge Holiday Park offers a tranquil and scenic retreat in New Zealand's North Island. With a variety of accommodation options available, including cabins, self-contained units, and powered camping sites, guests can choose the option that best suits their needs. The holiday park provides direct access to the lake, allowing visitors to indulge in activities such as swimming, fishing, and boating. The peaceful surroundings, combined with the park's amenities, including BBQ areas, a playground, and communal facilities, create a welcoming atmosphere for a memorable lakeside getaway.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 17,
            "title": "Tasman Glacier Lake",
            "location": "Aoraki / Mt Cook, Canterbury",
            "coords": [170.1639429, -43.6966787],
            "rating": 8.5,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e8/Tasman_Lake_03.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Tasman Glacier Lake, located in Aoraki/Mount Cook National Park, is a mesmerizing glacial lake that showcases the awe-inspiring beauty of New Zealand's Southern Alps. This turquoise-colored lake is nestled amidst snow-capped peaks and surrounded by the remnants of the Tasman Glacier. Visitors can embark on a boat tour to explore the lake, getting up close to the icebergs that have calved from the glacier. The tranquil setting and the impressive glacier backdrop make Tasman Glacier Lake a captivating destination for nature lovers and photographers seeking to immerse themselves in the grandeur of the alpine landscapes.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 18,
            "title": "Akaroa Top 10 Holiday Park",
            "location": "Akaroa, Canterbury",
            "coords": [172.971197, -43.796529],
            "rating": 9.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 48.4,
            "description": "Nestled in the picturesque Banks Peninsula on the South Island of New Zealand, Akaroa Top 10 Holiday Park offers a delightful coastal getaway. This holiday park provides a range of accommodation options, from fully self-contained units to powered camping sites, catering to different preferences and budgets. Surrounded by stunning natural beauty, visitors can explore the charming town of Akaroa, known for its French heritage, or indulge in outdoor activities such as swimming, kayaking, and hiking. With its peaceful ambiance and proximity to scenic attractions, Akaroa Top 10 Holiday Park serves as an ideal base for exploring the region's beauty.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 19,
            "title": "International Antarctic Centre",
            "location": "Christchurch, Canterbury",
            "coords": [172.5493929, -43.48209115],
            "rating": 9,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/84/International_Antarctic_Centre_01.JPG",
            "imageAlt": "",
            "price": 59,
            "description": "The International Antarctic Centre, located in Christchurch, New Zealand, offers a captivating and immersive experience that provides a glimpse into the icy world of Antarctica. Visitors can embark on simulated Antarctic storm experiences, ride in a Hagglund all-terrain vehicle, and learn about the scientific research conducted on the frozen continent. The center also houses a variety of interactive exhibits, allowing guests to discover the unique wildlife, history, and challenges of Antarctica. With its engaging displays, informative presentations, and hands-on activities, the International Antarctic Centre offers an educational and unforgettable adventure for all ages.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 20,
            "title": "New Brighton Pier",
            "location": "Christchurch, Canterbury",
            "coords": [172.7290035, -43.5074811],
            "rating": 5.5,
            "imageUrl": "https://live.staticflickr.com/1789/42025608835_d458c86e69_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Stretching out into the sparkling waters of the Pacific Ocean, New Brighton Pier in Christchurch is a popular destination for locals and tourists alike. This iconic landmark offers panoramic views of the coastline and provides a scenic spot for leisurely walks, fishing, and taking in the fresh sea breeze. The pier is also home to a vibrant community hub, hosting events, markets, and activities throughout the year. Whether it's enjoying a stunning sunset, observing marine life, or simply strolling along the pier, New Brighton Pier offers a delightful experience by the sea.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 21,
            "title": "Hokitika Kiwi Holiday Park & Motels",
            "location": "Hokitika, West Coast",
            "coords": [170.979182, -42.716515],
            "rating": 2,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 100,
            "description": "Located in the charming town of Hokitika on the West Coast of New Zealand's South Island, Hokitika Kiwi Holiday Park & Motels provides comfortable and convenient accommodation options. From fully equipped motel units to self-contained cabins and camping sites, guests can choose the option that suits their needs. The holiday park offers a range of facilities, including communal kitchens, BBQ areas, and a children's playground. With its proximity to Hokitika's attractions, such as the Hokitika Gorge and the town's famous driftwood sculptures, Hokitika Kiwi Holiday Park & Motels serves as a great base for exploring the natural wonders of the region.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 22,
            "title": "Hokitika Gorge",
            "location": "Hokitika, West Coast",
            "coords": [171.028315, -42.872203],
            "rating": 7.5,
            "imageUrl": "https://live.staticflickr.com/2406/2215299702_e41163eb34_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Hokitika Gorge, situated a short drive from the town of Hokitika on New Zealand's West Coast, is a hidden gem that showcases the beauty of nature in its purest form. The gorge features stunning turquoise waters that flow through a narrow gorge, surrounded by lush native forest. Visitors can embark on a short walk along a well-maintained track, leading to a swing bridge that offers breathtaking views of the gorge and its vibrant blue waters. Hokitika Gorge is a photographer's paradise and a must-visit destination for those seeking natural beauty and tranquility.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 23,
            "title": "Hokitika Treetop Walk",
            "location": "Hokitika, West Coast",
            "coords": [170.920735, -42.809263],
            "rating": 8.5,
            "imageUrl": "https://live.staticflickr.com/3806/13473422433_0f8ee95408_b.jpg",
            "imageAlt": "",
            "price": 32.4,
            "description": "The Hokitika Treetop Walk provides a unique and elevated perspective of the enchanting West Coast rainforest near Hokitika. Visitors can traverse a series of suspended walkways and viewing platforms, allowing them to immerse themselves in the lush canopy of ancient trees. The walk offers an opportunity to appreciate the incredible biodiversity of the region, with informative signage along the way highlighting the flora and fauna. As visitors stroll amidst the treetops, they can enjoy panoramic views of the surrounding mountains and the untamed beauty of the West Coast rainforest.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 24,
            "title": "Twin Glacier Helicopter Ride",
            "location": "Franz Josef / Waiau, West Coast",
            "coords": [170.1819923, -43.3885481],
            "rating": 10,
            "imageUrl": "https://www.publicdomainpictures.net/pictures/120000/nahled/helicopter-14252555737SJ.jpg",
            "imageAlt": "",
            "price": 385,
            "description": "A Twin Glacier Helicopter Ride offers a once-in-a-lifetime opportunity to witness the awe-inspiring beauty of New Zealand's glaciers from a unique perspective. Departing from Franz Josef or Fox Glacier on the South Island's West Coast, this exhilarating helicopter ride takes passengers high above the rugged landscape to explore the Franz Josef and Fox Glaciers. The flight provides breathtaking views of the pristine ice formations, deep crevasses, and towering peaks of the Southern Alps. The experience often includes a snow landing, allowing guests to step foot on the glacier and experience its icy wonder up close. A Twin Glacier Helicopter Ride is an extraordinary adventure that showcases the magnificence of New Zealand's glacial landscapes.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 25,
            "title": "Punakaiki Pancake Rocks",
            "location": "Punakaiki, West Coast",
            "coords": [171.329892, -42.11561],
            "rating": 7,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/56/Pancake_Rocks%2C_Punakaiki.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Situated on the West Coast of New Zealand's South Island, the Punakaiki Pancake Rocks and Blowholes are a natural wonder that never fails to captivate visitors. These unique rock formations, shaped like stacked pancakes, have been sculpted over millions of years by the erosive forces of the sea and wind. As waves crash against the rocks, water is forced through narrow blowholes, creating spectacular geysers and booming sounds. A network of well-maintained walkways and viewing platforms allows visitors to explore the area and witness the dramatic display of nature's power. The Pancake Rocks are a must-see attraction, offering a mesmerizing and otherworldly experience along the West Coast.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 26,
            "title": "Carters Beach Top 10 Holiday Park",
            "location": "Westport, West Coast",
            "coords": [171.554932, -41.749669],
            "rating": 4.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 24,
            "description": "Carters Beach Top 10 Holiday Park, located near Westport on New Zealand's South Island, offers a relaxing coastal retreat for travelers. Set against a backdrop of golden sands and rolling waves, this holiday park provides a range of accommodation options, from self-contained units to powered camping sites. Guests can enjoy direct access to the beach, perfect for leisurely strolls, beachcombing, or simply soaking up the sun. The park features amenities such as BBQ areas, a children's playground, and communal facilities, ensuring a comfortable and enjoyable stay for visitors seeking a beachside escape.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 27,
            "title": "Buller Gorge",
            "location": "West Coast",
            "coords": [171.8383203, -41.8588332],
            "rating": 1,
            "imageUrl": "https://live.staticflickr.com/8164/7180501600_85cb2d3978_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Buller Gorge, nestled along the Buller River on the South Island's West Coast, is a natural wonder that showcases the power and beauty of New Zealand's landscapes. Carved over millennia, this deep gorge is surrounded by lush native forest, rugged cliffs, and the crystal-clear waters of the Buller River. Visitors can explore the gorge on foot, crossing suspension bridges and traversing well-maintained walking trails that offer stunning viewpoints. Thrill-seekers can also experience the exhilaration of jet boating or white-water rafting through the rapids of the Buller River. Buller Gorge is a testament to the raw and untamed beauty of New Zealand's natural environment.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 28,
            "title": "A1 Kaikoura Holiday Park",
            "location": "Kaikoura, Canterbury",
            "coords": [173.68004, -42.398457],
            "rating": 8.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 21,
            "description": "A1 Kaikoura Holiday Park, located in the picturesque coastal town of Kaikoura on New Zealand's South Island, offers a comfortable and convenient base for exploring the region's natural wonders. The holiday park provides a range of accommodation options, including cabins, self-contained units, and powered camping sites. Visitors can take advantage of the park's facilities, which include communal kitchens, BBQ areas, and a playground. Kaikoura is renowned for its rich marine life, and guests can embark on whale-watching tours, swim with dolphins, or sample delicious seafood in the town's restaurants. A1 Kaikoura Holiday Park is an ideal choice for nature enthusiasts and those seeking an unforgettable coastal experience.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 29,
            "title": "Motueka Top 10 Holiday Park",
            "location": "Motueka, Tasman",
            "coords": [173.013526, -41.104444],
            "rating": 3,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 180,
            "description": "Motueka Top 10 Holiday Park, situated near the entrance to Abel Tasman National Park on New Zealand's South Island, offers a convenient and comfortable accommodation option for visitors exploring the region's natural beauty. The holiday park features a variety of accommodation choices, including self-contained units, cabins, and camping sites. Guests can relax in the park's peaceful surroundings or take advantage of amenities such as BBQ areas, a swimming pool, and a children's playground. Motueka is a gateway to Abel Tasman National Park, renowned for its golden beaches, turquoise waters, and coastal walking tracks. Motueka Top 10 Holiday Park provides a convenient base for experiencing the breathtaking landscapes and outdoor activities of the region.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 30,
            "title": "Abel Tasman Sea Shuttle",
            "location": "Abel Tasman National Park, Tasman",
            "coords": [173.017432, -41.037013],
            "rating": 8.5,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/2c/NZ310315_Abel_Tasman_Te_Pukatea_Bay_05.jpg",
            "imageAlt": "",
            "price": 80,
            "description": "The Abel Tasman Sea Shuttle offers a convenient and scenic way to explore the stunning coastal paradise of Abel Tasman National Park on New Zealand's South Island. Departing from various points along the coast, the sea shuttle provides transportation to different destinations within the park, allowing visitors to customize their experience. Passengers can hop on and off at various beaches, enjoy leisurely walks along the coastal tracks, or simply relax on the boat and take in the beauty of the surrounding landscapes. With its turquoise waters, golden sands, and lush forested hills, Abel Tasman National Park is a haven for outdoor enthusiasts and nature lovers.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 31,
            "title": "Wharariki Beach",
            "location": "Puponga, Tasman",
            "coords": [172.7167893, -40.5209134],
            "rating": 6.5,
            "imageUrl": "https://images.pexels.com/photos/10820198/pexels-photo-10820198.jpeg",
            "imageAlt": "",
            "price": 0,
            "description": "Wharariki Beach, located near Farewell Spit on the northern tip of New Zealand's South Island, is a hidden gem that offers a serene and secluded coastal experience. This pristine beach stretches for miles, with powdery white sand, dramatic sand dunes, and crystal-clear waters. Visitors can enjoy leisurely walks along the shoreline, collect seashells, or simply relax and soak up the peaceful ambiance. Wharariki Beach is also a popular spot for birdwatching, as it is home to a variety of native and migratory bird species. For those seeking tranquility and natural beauty, Wharariki Beach is a must-visit destination.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 32,
            "title": "Te Waikoropupu Springs",
            "location": "Takaka, Tasman",
            "coords": [172.7728803, -40.856285],
            "rating": 9.5,
            "imageUrl": "https://live.staticflickr.com/4345/37079156485_d5ed781f3b_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Located in Golden Bay on the South Island of New Zealand, Te Waikoropupu Springs is a sacred and pristine natural wonder. These crystal-clear freshwater springs are renowned for their exceptional clarity, making them some of the clearest waters in the world. Visitors can follow a gentle walking track that winds through lush native forest and leads to viewing platforms overlooking the springs. The springs hold great cultural and spiritual significance to the local Māori people and are considered a taonga (treasure). Te Waikoropupu Springs is not only a breathtaking natural attraction but also a place of reverence and tranquility.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 33,
            "title": "Cable Bay Adventure Park Skywire",
            "location": "Nelson, Nelson",
            "coords": [173.412792, -41.201776],
            "rating": 8,
            "imageUrl": "img/Placeholder_Activity.png",
            "imageAlt": "",
            "price": 110,
            "description": "For thrill-seekers and adrenaline enthusiasts, the Cable Bay Adventure Park Skywire in Nelson offers an exhilarating and unforgettable experience. Suspended high above the lush forest canopy, the Skywire is a thrilling zipline adventure that allows participants to soar through the air at high speeds, taking in breathtaking views of the surrounding landscapes. With the help of expert guides and state-of-the-art equipment, guests can experience the rush of flying through the treetops, feeling the wind on their faces, and taking in the panoramic vistas below. The Cable Bay Adventure Park Skywire is an ultimate adventure for those seeking an adrenaline-pumping activity and a unique perspective of the Nelson region.",
            "categories": ["South Island", "Activity"]
        },
        {
            "id": 34,
            "title": "Lake Rotoiti, Nelson Lakes National Park",
            "location": "St. Arnaud, Tasman",
            "coords": [172.84689945967244,-41.806771900514065],
            "rating": 9,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/f/f8/View_of_Lake_Rotoiti_from_Kerr_Bay_in_St_Arnaud_%284672177850%29.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Nestled within the stunning Nelson Lakes National Park on the South Island, Lake Rotoiti is a picturesque alpine lake that offers a peaceful and serene escape into nature. Surrounded by snow-capped mountains, dense forests, and rolling hills, the lake provides a beautiful backdrop for a range of outdoor activities. Visitors can enjoy kayaking, boating, or fishing on the tranquil waters, hike along the scenic lakeside trails, or simply relax on the sandy beaches and soak up the natural beauty. With its pristine waters, breathtaking scenery, and abundant wildlife, Lake Rotoiti is a haven for nature lovers and a must-visit destination in the Nelson region.",
            "categories": ["South Island", "Landmark"]
        },
        {
            "id": 35,
            "title": "Picton Tasman Holiday Park",
            "location": "Picton, Marlborough",
            "coords": [174.015011, -41.28855],
            "rating": 9,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 17,
            "description": "Located in the charming coastal town of Picton, at the gateway to the beautiful Marlborough Sounds on New Zealand's South Island, Picton Tasman Holiday Park offers a comfortable and convenient base for exploring the region's natural wonders. The holiday park provides a variety of accommodation options, from self-contained units to camping sites, catering to different preferences and budgets. Guests can take advantage of amenities such as communal kitchens, BBQ areas, and a playground. Picton is not only a scenic coastal town but also a hub for exploring the Marlborough Sounds, famous for their pristine bays, secluded beaches, and abundant marine life. Picton Tasman Holiday Park serves as an ideal starting point for embarking on adventures in this breathtaking region.",
            "categories": ["South Island", "Accommodation"]
        },
        {
            "id": 36,
            "title": "Picton-Wellington Ferry",
            "location": "Cook Strait",
            "coords": [174.000519, -41.290321],
            "rating": 7.5,
            "imageUrl": "https://live.staticflickr.com/2527/3911163156_23015a1362_c.jpg",
            "imageAlt": "",
            "price": 129,
            "description": "The Picton-Wellington Ferry is a scenic and convenient transport route connecting the North Island and South Island of New Zealand. The ferry journey crosses the picturesque Cook Strait, offering breathtaking views of the surrounding coastal landscapes and the distant mountains. The ferry service operates between the ports of Picton in the South Island and Wellington, the capital city of New Zealand, in the North Island. Passengers can enjoy onboard amenities such as cafes, restaurants, and comfortable seating areas, making the journey a pleasant and relaxing experience. The Picton-Wellington Ferry is not only a means of transportation but also a scenic adventure that allows travelers to appreciate the beauty of New Zealand's coastal and marine environments.",
            "categories": ["South Island", "North Island", "Activity"]
        },
        {
            "id": 37,
            "title": "Te Papa National Museum",
            "location": "Wellington, Wellington",
            "coords": [174.781798, -41.290497],
            "rating": 8,
            "imageUrl": "https://live.staticflickr.com/221/501971083_690a7c6616_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Situated on the waterfront of Wellington, New Zealand's capital city, Te Papa Tongarewa (Te Papa for short) is the country's national museum and a cultural treasure trove. This world-class museum offers an immersive and interactive experience that showcases the diverse history, art, culture, and natural environment of New Zealand. Visitors can explore engaging exhibitions, including Maori and Pacific Island collections, contemporary and traditional artworks, interactive displays, and fascinating insights into the country's unique flora and fauna. Te Papa also hosts regular events, performances, and educational programs, providing an enriching experience for visitors of all ages. A visit to Te Papa National Museum is a journey through New Zealand's rich heritage and a deep appreciation of its cultural and natural wonders.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 38,
            "title": "Martinborough Top 10 Holiday Park",
            "location": "Martinborough, Wellington",
            "coords": [175.45174, -41.21594],
            "rating": 4,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 28,
            "description": "Located in the heart of the Wairarapa wine region, Martinborough Top 10 Holiday Park offers a delightful retreat for wine enthusiasts and travelers seeking a tranquil escape. The holiday park provides various accommodation options, from self-contained units to camping sites, surrounded by picturesque vineyards and rolling countryside. Guests can explore the nearby Martinborough village, known for its boutique wineries, charming cafes, and quaint shops. Wine tastings and vineyard tours are popular activities, allowing visitors to sample award-winning wines and immerse themselves in the region's renowned viticulture. Martinborough Top 10 Holiday Park is an excellent base for experiencing the beauty of the Wairarapa region and indulging in its renowned wine culture.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 39,
            "title": "Cape Palliser Lighthouse",
            "location": "Cape Palliser, Wellington",
            "coords": [175.291603, -41.612669],
            "rating": 7.5,
            "imageUrl": "https://cdn.pixabay.com/photo/2021/01/03/22/52/cape-palliser-5885844_1280.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Perched on the southernmost tip of the North Island, Cape Palliser Lighthouse is an iconic landmark that offers panoramic views of the rugged coastline and the wild waters of the Cook Strait. Visitors can climb the 253 steps to reach the top of the lighthouse and be rewarded with breathtaking vistas of the surrounding landscapes. The lighthouse, steeped in history, stands as a testament to New Zealand's maritime heritage and plays a vital role in guiding ships through the treacherous waters. Nearby, a resident fur seal colony can often be spotted lounging on the rocky shore, adding to the natural charm of the area. Cape Palliser Lighthouse is not only a historical site but also a place of dramatic beauty, making it a must-visit destination for travelers exploring the southernmost reaches of the North Island.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 40,
            "title": "Putangirua Pinnacles",
            "location": "Cape Palliser, Wellington",
            "coords": [175.221767, -41.449004],
            "rating": 7.5,
            "imageUrl": "https://live.staticflickr.com/317/32511978405_4903acdb96_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Located in the remote Aorangi Forest Park on the southern coast of the North Island, the Putangirua Pinnacles are a natural marvel and a photographer's dream. These towering rock formations, shaped by centuries of erosion, resemble an otherworldly landscape straight out of a fantasy movie. Visitors can embark on a scenic walking trail that winds through the enchanting Pinnacles, with their intricate shapes and unique geological formations. The trail meanders through a narrow gorge, revealing awe-inspiring views at every turn. The Putangirua Pinnacles provide a surreal and mystical experience, transporting visitors to a realm of natural beauty and wonder.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 41,
            "title": "Castlepoint Holiday Park",
            "location": "Castlepoint, Wellington",
            "coords": [176.218048, -40.896494],
            "rating": 7.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 22.5,
            "description": "Situated in the idyllic coastal town of Castlepoint, on the southern coast of the North Island, Castlepoint Holiday Park offers a tranquil seaside getaway for travelers. The holiday park provides a range of accommodation options, including cabins, self-contained units, and camping sites, all within walking distance of the stunning Castlepoint Beach. Visitors can enjoy swimming, surfing, or sunbathing on the golden sands, explore the picturesque lighthouse perched atop Castle Rock, or embark on scenic coastal walks with breathtaking views of the surrounding landscapes. Castlepoint is a hidden gem known for its natural beauty and peaceful ambiance, making Castlepoint Holiday Park an ideal choice for a relaxing coastal retreat.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 42,
            "title": "Whanganui Top 10 Holiday Park",
            "location": "Whanganui, Manawatu-Whanganui",
            "coords": [175.089308, -39.894576],
            "rating": 2.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 22,
            "description": "Nestled along the banks of the mighty Whanganui River on the North Island of New Zealand, Whanganui Top 10 Holiday Park offers a peaceful and picturesque escape into nature. The holiday park provides a variety of accommodation options, including self-contained units, cabins, and camping sites. Guests can relax in the serene riverside setting, enjoy riverside walks, or explore the charming town of Whanganui with its historic buildings, art galleries, and vibrant cultural scene. The Whanganui River, revered by the local Māori as a taonga (treasure), offers opportunities for kayaking, jet boating, or cruising, allowing visitors to immerse themselves in the natural beauty and cultural significance of the region. Whanganui Top 10 Holiday Park provides a welcoming and comfortable base for experiencing the enchanting Whanganui River and its surroundings.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 43,
            "title": "New Plymouth Top 10 Holiday Park",
            "location": "New Plymouth, Taranaki",
            "coords": [174.107584, -39.046585],
            "rating": 5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 106,
            "description": "Located in the coastal city of New Plymouth, on the western coast of the North Island, New Plymouth Top 10 Holiday Park offers a convenient and comfortable accommodation option for exploring the region's attractions. The holiday park features a variety of accommodation choices, including cabins, self-contained units, and camping sites, catering to different needs and preferences. Guests can take advantage of the park's facilities, which may include BBQ areas, a playground, and communal kitchens. New Plymouth is known for its vibrant arts scene, beautiful gardens, and the iconic Mount Taranaki as a backdrop. Visitors can explore the scenic coastal walkway, visit the acclaimed Govett-Brewster Art Gallery, or indulge in outdoor activities such as surfing or hiking. New Plymouth Top 10 Holiday Park provides a convenient base for discovering the natural beauty and cultural offerings of the Taranaki region.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 44,
            "title": "Otorohanga Holiday Park",
            "location": "Otorohanga, Waikato",
            "coords": [175.213609, -38.186864],
            "rating": 8,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 24,
            "description": "Situated in the charming town of Otorohanga, in the Waikato region of the North Island, Otorohanga Holiday Park offers a tranquil and family-friendly accommodation option for travelers. The holiday park provides a range of accommodation choices, including self-contained units, cabins, and camping sites, surrounded by peaceful rural landscapes. Guests can enjoy the park's amenities, which may include a swimming pool, BBQ areas, and a playground. Otorohanga is also known as the 'Kiwiana Town' due to its close association with New Zealand's iconic bird, the kiwi. Visitors can learn about kiwi conservation efforts at the Otorohanga Kiwi House and Native Bird Park, or explore the nearby Waitomo Caves, famous for their dazzling glowworm displays. Otorohanga Holiday Park offers a welcoming and convenient base for exploring the attractions of the Waikato region.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 45,
            "title": "Waitomo Glowworm Caves",
            "location": "Waitomo Caves, Wakato",
            "coords": [175.104961, -38.260752],
            "rating": 3.5,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/33/Waitomo_Cave.jpg",
            "imageAlt": "",
            "price": 75,
            "description": "The Waitomo Glowworm Caves, located in the Waikato region of the North Island, are a natural wonder that never fails to captivate visitors. Step into a mesmerizing underground world as you explore these limestone caves adorned with stalactites, stalagmites, and other fascinating rock formations. The highlight of the experience is the enchanting glowworm display. Thousands of tiny glowworms illuminate the darkness, creating a breathtaking starry sky-like spectacle. Visitors can take guided tours through the caves, learning about their geological significance and the life cycle of glowworms. For a truly magical experience, a boat ride along the underground river allows visitors to glide beneath the twinkling glowworms, creating an unforgettable memory of their time in New Zealand.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 46,
            "title": "Taupo Top 10 Holiday Park",
            "location": "Taupo, Waikato",
            "coords": [176.088636, -38.683647],
            "rating": 6,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 96,
            "description": "Nestled on the shores of Lake Taupo, the largest lake in New Zealand, Taupo Top 10 Holiday Park offers a picturesque retreat for nature lovers and outdoor enthusiasts. The holiday park provides a range of accommodation options, including self-contained units, cabins, and camping sites, all within easy reach of the lake and its scenic surroundings. Guests can enjoy swimming, fishing, or boating on the crystal-clear waters of Lake Taupo, explore nearby geothermal attractions such as the Craters of the Moon Thermal Walk, or embark on hiking trails that lead to stunning viewpoints and waterfalls. Taupo Top 10 Holiday Park serves as an ideal base for exploring the natural wonders of the Taupo region and enjoying the tranquility of lakeside living.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 47,
            "title": "Craters of the Moon Thermal Walk",
            "location": "Taupo, Waikato",
            "coords": [176.0717, -38.644116],
            "rating": 7,
            "imageUrl": "https://live.staticflickr.com/65535/50921155441_319d126e64_b.jpg",
            "imageAlt": "",
            "price": 10,
            "description": "Located near Taupo in the North Island, the Craters of the Moon Thermal Walk is a unique and otherworldly geothermal area that offers a glimpse into the forces of nature. Visitors can embark on a self-guided walking trail that winds through a surreal landscape of steaming vents, bubbling mud pools, and hissing fumaroles. The walkway meanders through the geothermal activity, providing informative signs and lookout points for an immersive experience. The Craters of the Moon Thermal Walk showcases the raw power and beauty of geothermal phenomena, offering a fascinating exploration of New Zealand's geothermal heritage.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 48,
            "title": "Huka Falls",
            "location": "Taupo, Waikato",
            "coords": [176.088194, -38.650007],
            "rating": 5.5,
            "imageUrl": "https://live.staticflickr.com/2127/2736030969_d13bf2bb9d_c.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Situated just a few kilometers north of Taupo, Huka Falls is a magnificent natural spectacle where the Waikato River narrows dramatically and rushes through a narrow gorge. The result is a breathtaking display of power and beauty as millions of liters of water cascade over the falls every minute. Visitors can witness the raw force of nature from various vantage points, including a footbridge that spans the river. The vibrant blue color of the water adds to the spectacle, creating a visual feast for the senses. Whether viewed from land or experienced up close on a jet boat ride, Huka Falls is a must-see attraction that showcases the awe-inspiring natural wonders of New Zealand.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 49,
            "title": "Lake Taupo",
            "location": "Taupo, Waikato",
            "coords": [176.075104, -38.694228],
            "rating": 10,
            "imageUrl": "https://live.staticflickr.com/8064/8252097266_f524cfb5cc_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Lake Taupo, nestled in the heart of the North Island, is the largest freshwater lake in New Zealand and a playground for outdoor enthusiasts. The crystal-clear waters of the lake offer endless opportunities for water-based activities such as swimming, boating, kayaking, and fishing. Anglers flock to Lake Taupo for its abundant trout population, while thrill-seekers can try their hand at thrilling water sports like jet skiing or parasailing. Surrounded by majestic mountains and lush forests, Lake Taupo is not only a scenic wonder but also a gateway to other attractions in the region, including geothermal areas, hiking trails, and cultural sites. A visit to Lake Taupo promises stunning vistas, adventure, and a deep appreciation for the natural beauty of New Zealand.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 50,
            "title": "Kennedy Park",
            "location": "Napier, Hawke's Bay",
            "coords": [176.899687, -39.503815],
            "rating": 7.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 72.9,
            "description": "Nestled in the heart of Napier on the eastern coast of the North Island, Kennedy Park is a popular holiday park that offers a range of accommodation options and amenities for travelers. The park features a variety of sites and facilities, including powered campsites, cabins, and communal spaces like BBQ areas and kitchens. Visitors can relax and enjoy the park's serene surroundings, take a dip in the swimming pool, or participate in activities such as mini-golf or tennis. Kennedy Park serves as a convenient base for exploring Napier's art deco architecture, strolling along the Marine Parade, and indulging in the region's renowned food and wine scene. Whether traveling with family or seeking a peaceful getaway, Kennedy Park provides a comfortable and convenient accommodation option in Napier.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 51,
            "title": "Napier National Aquarium",
            "location": "Napier, Hawke's Bay",
            "coords": [176.918794, -39.5009],
            "rating": 7,
            "imageUrl": "https://live.staticflickr.com/5458/7087613617_1f63b2fd36_b.jpg",
            "imageAlt": "",
            "price": 25,
            "description": "Situated on Napier's Marine Parade, the Napier National Aquarium is a must-visit destination for marine enthusiasts and families alike. The aquarium showcases a diverse range of marine life, from native New Zealand species to exotic creatures from around the world. Visitors can explore various exhibits, including an impressive oceanarium with a walk-through tunnel, allowing them to observe sharks, rays, and a myriad of colorful fish up close. The aquarium also offers informative presentations, interactive displays, and a touch tank experience for a hands-on encounter with marine creatures. The Napier National Aquarium provides a captivating and educational experience, highlighting the beauty and importance of the ocean and its inhabitants.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 52,
            "title": "Mahia Peninsula",
            "location": "Mahia, Hawke's Bay",
            "coords": [177.87238166126684,-39.08629371750735],
            "rating": 7,
            "imageUrl": "https://live.staticflickr.com/1898/44160123422_8de1e3f9dc_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Located on the eastern coast of the North Island, the Mahia Peninsula is a hidden gem known for its stunning beaches, tranquil bays, and relaxed coastal atmosphere. The peninsula offers a range of outdoor activities, including swimming, surfing, fishing, and boating. Visitors can explore the scenic coastal walks, visit the iconic Mahia Beach Rocket Lab launch site, or simply unwind on the pristine sandy shores. The Mahia Peninsula is also renowned for its starry skies, making it an ideal spot for stargazing and astrophotography. Whether seeking adventure or tranquility, the Mahia Peninsula provides a peaceful coastal retreat and a chance to reconnect with nature.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 53,
            "title": "Waikanae Beach Top 10 Holiday Park",
            "location": "Gisborne, Gisborne",
            "coords": [178.018089, -38.670665],
            "rating": 4.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 30,
            "description": "Situated in the coastal town of Waikanae, on the Kapiti Coast of the North Island, Waikanae Beach Top 10 Holiday Park offers a relaxing seaside escape for visitors. The holiday park provides a variety of accommodation options, including cabins, self-contained units, and camping sites, all within walking distance of the beautiful Waikanae Beach. Guests can enjoy leisurely walks along the sandy shores, soak up the sun, or take a refreshing dip in the ocean. The park's convenient location also allows easy access to nearby attractions, such as the Nga Manu Nature Reserve, where visitors can observe native birdlife and explore native bush trails. Waikanae Beach Top 10 Holiday Park is a perfect destination for those seeking a coastal getaway with a mix of relaxation and outdoor activities.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 54,
            "title": "Rere Falls",
            "location": "Gisborne, Gisborne",
            "coords": [177.60992072031144,-38.53705683000651],
            "rating": 1,
            "imageUrl": "https://live.staticflickr.com/1571/24495025349_089843b199_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Located in the Gisborne region of the North Island, the Rere Falls is a picturesque waterfall that cascades down a series of terraces, creating a mesmerizing spectacle. Visitors can witness the power and beauty of the falls from various viewpoints, and during certain times of the year, adventurous souls can even take the plunge and slide down the natural rock slides formed by the waterfall. The surrounding area offers picnic spots, walking trails, and a peaceful ambiance, making it an ideal place for a family outing or a tranquil retreat into nature. Rere Falls is a hidden gem, tucked away in the heart of New Zealand's lush countryside, offering a refreshing escape from the hustle and bustle of everyday life.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 55,
            "title": "Rere Rockslide",
            "location": "Gisborne, Gisborne",
            "coords": [177.58773525362778,-38.5403344709217],
            "rating": 8,
            "imageUrl": "https://live.staticflickr.com/357/19606261199_0c63179a17_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Located near the Rere Falls, the Rere Rockslide is an exhilarating natural waterslide carved into a smooth rock surface by the Wharekopae River. It offers an exciting adventure for thrill-seekers of all ages. Visitors can grab an inflatable tube or bodyboard and slide down the slippery slope, gliding through the clear water with an adrenaline rush. The Rere Rockslide is a unique and thrilling experience that promises laughter and fun as you embrace the force of the flowing water. It is a popular attraction for locals and visitors alike, providing a memorable and refreshing adventure in the heart of nature.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 56,
            "title": "Tolaga Bay Pier",
            "location": "Tolaga Bay, Gisborne",
            "coords": [178.317476, -38.386032],
            "rating": 3.5,
            "imageUrl": "https://c0.wallpaperflare.com/preview/606/840/923/new-zealand-tolaga-bay-tolaga-bay-wharf-water.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Stretching out into the Pacific Ocean, the Tolaga Bay Pier is an iconic landmark and the longest pier in New Zealand, extending over 600 meters. Built in the early 20th century, the pier served as a landing point for ships and facilitated the export of goods from the region. Today, it offers a scenic spot for leisurely strolls, fishing, and admiring panoramic views of the coastline. The pier's weathered wooden pillars and expansive length create a nostalgic and timeless atmosphere, making it a favorite spot for photographers and history enthusiasts. Tolaga Bay Pier is a testament to the region's maritime heritage and provides a captivating backdrop for visitors to enjoy the beauty of the East Coast.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 57,
            "title": "East Cape Campground",
            "location": "Te Araroa, Gisborne",
            "coords": [178.501938, -37.665605],
            "rating": 6,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 16.88,
            "description": "Nestled on the easternmost point of the North Island, East Cape Campground offers a secluded and peaceful camping experience surrounded by breathtaking natural beauty. Situated near the iconic East Cape Lighthouse, the campground provides a range of camping sites, allowing visitors to immerse themselves in the rugged coastal landscapes and unwind in a tranquil setting. The area is known for its stunning sunrises, where early risers can witness the first sunrise of the new day in New Zealand. Exploring the nearby East Cape Lighthouse, taking scenic walks along the coastal cliffs, or simply relaxing on the pristine beaches are popular activities for campers at East Cape. The campground offers a chance to disconnect from the hustle and bustle of modern life and connect with the raw beauty of nature.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 58,
            "title": "East Cape Lighthouse",
            "location": "Gisborne",
            "coords": [178.54818941036632,-37.68910156993827],
            "rating": 9.5,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e0/East_Cape_Lighthouse_%281%29_%2825579637567%29.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Perched atop dramatic cliffs on the easternmost point of the North Island, the East Cape Lighthouse stands as a beacon overlooking the vast Pacific Ocean. The lighthouse, with its distinctive white tower, has been guiding ships since 1900 and holds historical significance in New Zealand's maritime heritage. Visitors can embark on a scenic drive along the East Cape Road to reach the lighthouse and enjoy panoramic views of the coastline. For those seeking adventure, climbing the 700 steps to the top of the lighthouse rewards them with breathtaking views of the surrounding ocean and rugged landscapes. The East Cape Lighthouse is not only an important navigational landmark but also a symbol of the area's natural beauty and resilience.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 59,
            "title": "Ohiwa Beach Tasman Holiday Park",
            "location": "Kutarere, Bay of Plenty",
            "coords": [177.161559, -37.990089],
            "rating": 5.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 14.4,
            "description": "Nestled along the pristine shores of Ohiwa Beach, on the Bay of Plenty's eastern coastline, Ohiwa Beach Tasman Holiday Park offers a tranquil seaside escape for visitors. The holiday park provides a range of accommodation options, including cabins, self-contained units, and camping sites, allowing guests to choose their preferred style of accommodation. The beach is just a stone's throw away, inviting visitors to enjoy swimming, sunbathing, or leisurely walks along the sandy shores. Nature lovers can explore the nearby Ohiwa Harbour, a haven for birdlife and a popular spot for kayaking and fishing. Ohiwa Beach Tasman Holiday Park offers a serene and scenic getaway, where guests can relax and unwind amidst the beauty of the Bay of Plenty region.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 60,
            "title": "Blue Lake Top 10 Holiday Park",
            "location": "Rotorua, Bay of Plenty",
            "coords": [176.33248, -38.187138],
            "rating": 2,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 148,
            "description": "Situated near the town of Rotorua in the North Island, Blue Lake Top 10 Holiday Park offers a picturesque lakeside retreat for nature lovers and outdoor enthusiasts. The holiday park provides a range of accommodation options, from self-contained units to powered camping sites, catering to different preferences and group sizes. Nestled on the shores of the stunning Blue Lake (Lake Tikitapu), guests have direct access to the crystal-clear waters for swimming, kayaking, or simply enjoying the serene surroundings. The area is also renowned for its mountain biking trails, with tracks suitable for all levels of experience. Blue Lake Top 10 Holiday Park is an ideal destination for those seeking a peaceful lakeside getaway and a chance to explore the natural wonders of the Rotorua region.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 61,
            "title": "Rotorua Skyline",
            "location": "Rotorua, Bay of Plenty",
            "coords": [176.222771, -38.109825],
            "rating": 9,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/0/0e/The_Luge_track_from_the_Gondala_above1_-_Rotorua_%28112996725%29.jpg",
            "imageAlt": "",
            "price": 78.5,
            "description": "Perched on Mount Ngongotaha in Rotorua, the Rotorua Skyline is a must-visit attraction that offers breathtaking panoramic views and a range of thrilling activities. Visitors can ascend to the summit in a gondola, enjoying sweeping vistas of Lake Rotorua and the surrounding geothermal landscape. At the top, an array of activities awaits, including the Skyline Luge, a gravity-fueled go-karting experience suitable for all ages. The Skyline also features a restaurant and café where visitors can indulge in delicious cuisine while taking in the stunning scenery. Whether it's the stunning views, the exhilarating luge ride, or a memorable dining experience, the Rotorua Skyline offers a unique perspective on the natural wonders and adventure opportunities in the area.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 62,
            "title": "Redwoods Treewalk",
            "location": "Rotorua, Bay of Plenty",
            "coords": [176.2732514, -38.1565762],
            "rating": 7,
            "imageUrl": "img/Placeholder_Activity.png",
            "imageAlt": "",
            "price": 39,
            "description": "Nestled within Rotorua's Whakarewarewa Forest, the Redwoods Treewalk is an enchanting eco-tourism experience that combines stunning natural beauty with a captivating treetop adventure. Visitors can embark on a guided walk along a series of elevated walkways suspended among the majestic redwood trees, providing a unique perspective of the forest and its towering giants. As the walkways gently sway and the sunlight filters through the leaves, the forest takes on a magical ambiance. During the evening, the treewalk is illuminated, creating an enchanting nighttime experience known as the Redwoods Nightlights. The Redwoods Treewalk is a mesmerizing journey that showcases the splendor of nature and offers a peaceful retreat into the heart of the forest.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 63,
            "title": "Polynesian Spa",
            "location": "Rotorua, Bay of Plenty",
            "coords": [176.258133, -38.137825],
            "rating": 9.5,
            "imageUrl": "https://live.staticflickr.com/4173/34141058902_b895e87fca_b.jpg",
            "imageAlt": "",
            "price": 40,
            "description": "Located on the shores of Lake Rotorua, the Polynesian Spa is a world-renowned geothermal spa that invites visitors to immerse themselves in the healing waters and rejuvenate their mind, body, and soul. The spa boasts a range of hot mineral pools fed by natural geothermal springs, each offering unique therapeutic properties. Guests can relax in the alkaline and acidic mineral pools, unwind in the luxurious private pools, or indulge in a variety of spa treatments, including massages and facials. The Polynesian Spa combines the healing powers of Rotorua's geothermal waters with tranquil surroundings, creating a blissful haven for relaxation and wellness.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 64,
            "title": "ZORB",
            "location": "Rotorua, Bay of Plenty",
            "coords": [176.221291, -38.103585],
            "rating": 4.5,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/28/Zorbing.jpg",
            "imageAlt": "",
            "price": 150,
            "description": "For those seeking a unique and adrenaline-pumping adventure, ZORB in Rotorua offers an experience like no other. ZORB is the original and world-famous activity where visitors can roll down a hill inside a giant inflatable ball, also known as a ZORB. The thrill-seekers can choose from various tracks, including the straight-line Zig-Zag track or the fast-paced Mega Track with twists and turns. As the ball rolls, riders are engulfed in a whirlwind of excitement and laughter. ZORB provides a safe and exhilarating experience that combines the thrill of rolling downhill with the joy of bouncing and spinning inside a giant ball. It's a must-try activity for those seeking a unique adventure in Rotorua.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 65,
            "title": "Wai-O-Tapu Thermal Wonderland",
            "location": "Rotorua, Bay of Plenty",
            "coords": [176.366888, -38.354107],
            "rating": 1,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/ab/ChampagnePool-Wai-O-Tapu_rotated_MC.jpg",
            "imageAlt": "",
            "price": 32.5,
            "description": "Located near Rotorua in the North Island, Wai-O-Tapu Thermal Wonderland is a geothermal wonderland that showcases the raw power and beauty of nature. The park is home to a diverse range of geothermal features, including colorful hot springs, bubbling mud pools, and the famous Lady Knox Geyser, which erupts daily. Visitors can explore the park's well-maintained walking trails and witness the geothermal activity up close, marveling at the vibrant hues created by minerals in the pools and the steam rising from the earth. The geothermal wonders of Wai-O-Tapu provide a fascinating glimpse into the forces that shape the Earth and create such unique landscapes.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 66,
            "title": "Waimangu Volcanic Valley",
            "location": "Rotorua, Bay of Plenty",
            "coords": [176.386276, -38.285324],
            "rating": 10,
            "imageUrl": "https://live.staticflickr.com/5049/5246898976_5042a90dc2_b.jpg",
            "imageAlt": "",
            "price": 94,
            "description": "Known as the world's youngest geothermal system, the Waimangu Volcanic Valley offers visitors a captivating journey through a pristine natural landscape shaped by volcanic activity. Situated near Rotorua, the valley features a network of walking trails that wind through a scenic wonderland of steaming lakes, geysers, and native bush. The valley's highlights include the stunning Inferno Crater, the largest hot water spring in the Southern Hemisphere, and the tranquil Lake Rotomahana, where visitors can take a boat cruise and witness the geothermal activity up close. Exploring the Waimangu Volcanic Valley allows visitors to witness the beauty and power of New Zealand's geothermal wonders while learning about the ecological processes that shape the region.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 67,
            "title": "Waihi Beach Tasman Holiday Park",
            "location": "Waihi Beach, Bay of Plenty",
            "coords": [175.937155, -37.398164],
            "rating": 8,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 87.6,
            "description": "Located in the coastal town of Waihi Beach, on the eastern coast of the North Island, Waihi Beach Tasman Holiday Park offers a perfect seaside retreat for visitors seeking sun, sand, and relaxation. The holiday park provides a range of accommodation options, including cabins, self-contained units, and powered camping sites, catering to different preferences and group sizes. Guests can take a short stroll to the pristine sandy beach, where they can swim, sunbathe, or take leisurely walks along the shore. The surrounding area offers opportunities for fishing, boating, and exploring nearby attractions such as the Karangahake Gorge. Waihi Beach Tasman Holiday Park is an idyllic destination for beach lovers, where they can unwind and soak up the coastal charm of the Bay of Plenty region.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 68,
            "title": "Mount Maunganui",
            "location": "Tauranga, Bay of Plenty",
            "coords": [176.17166212354687,-37.63066336141049],
            "rating": 8,
            "imageUrl": "https://live.staticflickr.com/8021/7703408526_d05dee6a1e_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Rising majestically at the end of a sandy peninsula, Mount Maunganui, or 'The Mount' as it's commonly known, is an iconic landmark and a popular destination for locals and visitors alike. The Mount offers a range of outdoor activities, from climbing to its summit for panoramic views of the coastline to surfing or swimming at its beautiful sandy beach. The area also boasts a vibrant café and restaurant scene, boutique shopping, and a lively atmosphere during the summer months. Whether you're seeking adventure, relaxation, or a vibrant beachside vibe, Mount Maunganui has something for everyone, making it a must-visit destination in the Bay of Plenty.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 69,
            "title": "Hobbiton",
            "location": "Matamata, Waikato",
            "coords": [175.682787, -37.872053],
            "rating": 10,
            "imageUrl": "https://live.staticflickr.com/1901/44816806474_88560258e7_b.jpg",
            "imageAlt": "",
            "price": 120,
            "description": "Nestled in the rolling hills of the Waikato region, Hobbiton is a magical attraction that transports visitors to the enchanting world of J.R.R. Tolkien's Middle-earth. This meticulously crafted film set was used in the renowned 'The Lord of the Rings' and 'The Hobbit' film trilogies. Visitors can embark on a guided tour through the lush green pastures, meandering through the hobbit holes, gardens, and charming landscapes. The attention to detail and the preservation of the original set make Hobbiton an immersive and unforgettable experience for fans of the books and movies. A visit to Hobbiton allows visitors to step into the world of hobbits and experience the whimsical charm of Middle-earth.",
            "categories": ["North Island", "Activity", "Landmark"]
        },
        {
            "id": 70,
            "title": "Hot Water Beach Top 10 Holiday Park",
            "location": "Whitianga, Waikato",
            "coords": [175.816845, -36.890107],
            "rating": 3.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 48,
            "description": "Located on the stunning Coromandel Peninsula, Hot Water Beach Top 10 Holiday Park offers a unique experience where visitors can soak in natural hot springs right on the beach. The holiday park provides a range of accommodation options, including cabins, self-contained units, and camping sites, all within walking distance of Hot Water Beach. At low tide, visitors can dig their own hot pool in the sand, allowing geothermally heated water to seep through, creating a natural spa-like experience. It's a perfect opportunity to relax, unwind, and enjoy the therapeutic benefits of the hot mineral-rich waters. Hot Water Beach Top 10 Holiday Park is a must-visit destination for those seeking a blend of natural beauty and rejuvenation on the Coromandel Peninsula.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 71,
            "title": "Hot Water Beach",
            "location": "Whitianga, Waikato",
            "coords": [175.823918, -36.888811000000004],
            "rating": 7,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/1/16/Excavations_on_Hot_Water_Beach_-New_Zealand-12Dec2008_%282%29.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Located on the Coromandel Peninsula, Hot Water Beach is a unique and geothermal phenomenon that allows visitors to dig their own hot pools in the sand. At low tide, hot water from underground thermal springs rises to the surface, creating an opportunity for a natural spa experience. Armed with a shovel (which can be rented locally), visitors can dig their own hot pool in the sand, creating a cozy spot to relax and soak in the warm thermal waters. The temperature of the water can reach up to 64 degrees Celsius (147 degrees Fahrenheit), providing a soothing and rejuvenating experience. Hot Water Beach is not only a natural wonder but also a social hub, where visitors gather to enjoy the therapeutic benefits of the hot pools and connect with fellow travelers. Whether you're seeking relaxation or a unique geothermal adventure, Hot Water Beach is a must-visit destination that combines natural beauty and indulgence in a truly unforgettable way.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 72,
            "title": "Cathedral Cove",
            "location": "Hahei, Waikato",
            "coords": [175.78962157512728,-36.827812140994446],
            "rating": 6,
            "imageUrl": "https://live.staticflickr.com/7177/6871579655_0a30c01832_b.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Situated on the Coromandel Peninsula, Cathedral Cove is a breathtaking natural landmark renowned for its stunning white sandy beach, turquoise waters, and unique rock formations. Accessible by boat or by foot via a picturesque walking trail, Cathedral Cove offers a sense of tranquility and serenity. Visitors can explore the cove, swim in the clear waters, and discover hidden caves and arches carved into the cliffs. The iconic rock formation resembling a cathedral provides a picture-perfect backdrop for photographers and nature enthusiasts. Cathedral Cove is a place of natural beauty that captures the essence of New Zealand's coastal landscapes and is a must-see destination on the Coromandel Peninsula.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 73,
            "title": "Red Beach Top 10 Holiday Park",
            "location": "Red Beach, Auckland",
            "coords": [174.705945, -36.601992],
            "rating": 9.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 38.4,
            "description": "Nestled on the shores of Red Beach, just north of Auckland, Red Beach Top 10 Holiday Park offers a coastal escape with stunning sea views and a range of accommodation options. The holiday park provides self-contained units, cabins, and camping sites, allowing guests to choose the style of accommodation that suits them best. Red Beach is known for its scenic beauty, with golden sands and clear blue waters perfect for swimming, surfing, and sunbathing. Visitors can enjoy leisurely walks along the beach, explore the nearby Shakespear Regional Park, or visit the vibrant town of Orewa. Red Beach Top 10 Holiday Park is an ideal destination for those seeking a relaxing coastal getaway within easy reach of Auckland.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 74,
            "title": "Sky Tower",
            "location": "Auckland, Auckland",
            "coords": [174.762215, -36.84854],
            "rating": 7.5,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/5/54/Auckland_Sky_Tower_%285186071375%29.jpg",
            "imageAlt": "",
            "price": 35,
            "description": "Dominating the Auckland skyline, the Sky Tower is an iconic landmark and a must-visit attraction in the bustling city. Standing at a height of 328 meters, it is the tallest freestanding structure in the Southern Hemisphere. Visitors can ascend to the observation deck for breathtaking panoramic views of Auckland's cityscape, harbor, and surrounding landscapes. For the thrill-seekers, the Sky Tower also offers the opportunity to experience the SkyJump or SkyWalk, adrenaline-fueled activities that allow you to leap off or walk around the tower's edge with safety harnesses. The Sky Tower is not only a symbol of Auckland but also a thrilling and unforgettable experience that showcases the city from a whole new perspective.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 75,
            "title": "Weta Workshop Unleashed",
            "location": "Auckland, Auckland",
            "coords": [174.76232344326024,-36.84904573862851],
            "rating": 4,
            "imageUrl": "img/Placeholder_Activity.png",
            "imageAlt": "",
            "price": 59,
            "description": "Immerse yourself in the world of movie magic at Weta Workshop Unleashed, located in the heart of Wellington. This interactive and immersive experience takes you behind the scenes of the award-winning Weta Workshop, renowned for its groundbreaking work in film and special effects. Visitors can explore a series of themed zones filled with life-sized sculptures, props, and costumes from iconic movies like 'The Lord of the Rings,' 'Avatar,' and 'District 9.' Get up close to the incredible craftsmanship and attention to detail that goes into creating these fantastical worlds. From creatures and characters to weapons and vehicles, Weta Workshop Unleashed offers a captivating journey into the realms of imagination.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 76,
            "title": "Auckland Zoo",
            "location": "Auckland, Auckland",
            "coords": [174.7184002, -36.8630731],
            "rating": 8,
            "imageUrl": "https://live.staticflickr.com/8296/7861795824_6f2b5f3dc2_b.jpg",
            "imageAlt": "",
            "price": 24,
            "description": "Discover an array of fascinating wildlife from around the world at the Auckland Zoo. Situated in Western Springs, this sprawling zoo is home to over 1,400 animals across 135 species. Visitors can observe majestic lions, playful monkeys, endangered native species, and many more. The zoo places a strong emphasis on conservation and education, providing informative talks, encounters, and interactive experiences for visitors of all ages. Stroll through beautifully landscaped habitats, learn about the importance of protecting biodiversity, and even have the opportunity to participate in behind-the-scenes experiences. Auckland Zoo offers a captivating day out for animal lovers and a chance to connect with the natural world.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 77,
            "title": "Kelly Tarlton's Aquarium",
            "location": "Auckland, Auckland",
            "coords": [174.817808, -36.847533],
            "rating": 7,
            "imageUrl": "https://live.staticflickr.com/1825/43013235601_fa3ac98eb8_b.jpg",
            "imageAlt": "",
            "price": 45,
            "description": "Dive into a world beneath the waves at Kelly Tarlton's Aquarium in Auckland. Located on the waterfront, this renowned attraction offers a unique and immersive marine experience. The aquarium features a range of exhibits showcasing New Zealand's diverse marine life, from colorful fish and mesmerizing jellyfish to playful penguins and majestic sharks. Visitors can walk through transparent tunnels, providing a 360-degree view of the underwater world, and even take part in interactive encounters and animal feeding sessions. For the adventurous, there's the opportunity to go on a thrilling Shark Dive or Snorkel Safari, getting up close and personal with these fascinating creatures. Kelly Tarlton's Aquarium is a must-visit destination for marine enthusiasts and those curious about the wonders of the ocean.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 78,
            "title": "Rainbow's End",
            "location": "Auckland, Auckland",
            "coords": [174.884221, -36.994225],
            "rating": 7,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/3/38/Rainbow%27s_End_Corkscrew_Coaster.jpg",
            "imageAlt": "",
            "price": 68,
            "description": "For a day filled with adrenaline-pumping fun and family entertainment, head to Rainbow's End, New Zealand's premier theme park. Located in Auckland, this popular attraction offers a wide range of thrilling rides and exciting experiences for visitors of all ages. From heart-stopping roller coasters and gravity-defying drop towers to interactive family rides and gentle attractions for the little ones, there's something for everyone. Explore the park's themed zones, enjoy live entertainment, and test your skills at the games arcade. Rainbow's End also features Kidz Kingdom, a dedicated area for younger children with age-appropriate rides and activities. Whether you're seeking excitement or a fun-filled day with the family, Rainbow's End guarantees a day of laughter, screams, and unforgettable memories.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 79,
            "title": "Russell Top 10 Holiday Park",
            "location": "Russell, Northland",
            "coords": [174.124911, -35.258955],
            "rating": 7.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 80.8,
            "description": "Located in the charming town of Russell in the Bay of Islands, Russell Top 10 Holiday Park offers a tranquil and picturesque retreat. The holiday park provides a range of accommodation options, from self-contained units to camping sites, catering to different preferences and budgets. Surrounded by native bush and just a short stroll from the town center and waterfront, guests can relax and enjoy the beauty of the Bay of Islands. Explore historic sites, go fishing or sailing, take a scenic cruise, or simply unwind on the beach. Russell Top 10 Holiday Park is a perfect base to explore the attractions of the Bay of Islands and experience the laid-back charm of Russell.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 80,
            "title": "Bay of Islands Cruise",
            "location": "Bay of Islands, Northland",
            "coords": [174.092691, -35.281427],
            "rating": 10,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Hole_in_the_Rock%2C_Paihia%2C_Bay_of_Islands.jpg",
            "imageAlt": "",
            "price": 145,
            "description": "Embark on a memorable journey through the stunning Bay of Islands on a scenic cruise. Departing from various points, including Paihia and Russell, these cruises take you on a voyage through crystal-clear waters, secluded bays, and picturesque islands. Marvel at the beauty of the Bay of Islands as you sail past iconic landmarks such as the 'Hole in the Rock' and the historic Cape Brett Lighthouse. Keep an eye out for dolphins, seals, and other marine wildlife that call this region home. Many cruises offer opportunities for swimming, kayaking, and exploring remote beaches. Whether you choose a half-day excursion or a full-day adventure, a Bay of Islands cruise is a fantastic way to appreciate the natural wonders and scenic landscapes of this renowned destination.",
            "categories": ["North Island", "Activity"]
        },
        {
            "id": 81,
            "title": "Waitangi Treaty Grounds",
            "location": "Waitangi, Northland",
            "coords": [174.080341452763, -35.2709056],
            "rating": 8,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/2d/Marae_on_Waitangi_Treaty_Ground.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Step into a significant chapter of New Zealand's history at the Waitangi Treaty Grounds, located in the Bay of Islands. This historic site holds great cultural and historical significance as the place where the Treaty of Waitangi, New Zealand's founding document, was signed between Māori chiefs and the British Crown in 1840. Visitors can explore the beautifully landscaped grounds, visit the Te Kōngahu Museum of Waitangi to learn about the treaty's history, and witness a powerful cultural performance. The site also features intricately carved meeting houses, including the stunning Te Whare Rūnanga, where cultural ceremonies and events take place. The Waitangi Treaty Grounds offer a profound insight into the country's past and the ongoing relationship between Māori and the Crown.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 82,
            "title": "Whatuwhiwhi Top 10 Holiday Park",
            "location": "Kaitaia, Northland",
            "coords": [173.389017, -34.873861],
            "rating": 2.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 32,
            "description": "Escape to the serene coastal paradise of Whatuwhiwhi Top 10 Holiday Park, nestled in the picturesque Karikari Peninsula in Northland. The holiday park offers a range of accommodation options, from self-contained units to camping sites, all within easy access of the stunning Whatuwhiwhi Beach. With its white sandy shores and crystal-clear waters, the beach is perfect for swimming, snorkeling, and beachcombing. Fishing enthusiasts can try their luck from the shore or head out on a fishing charter to catch some of the abundant marine life. The area is also known for its beautiful scenic drives, exploring nearby beaches, and visiting the Karikari Estate Winery. Whatuwhiwhi Top 10 Holiday Park is an idyllic haven for those seeking a peaceful coastal getaway and the chance to reconnect with nature.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 83,
            "title": "Cape Reinga Lighthouse",
            "location": "Cape Reinga, Northland",
            "coords": [172.67612820709536,-34.42635459584008],
            "rating": 5,
            "imageUrl": "https://p1.pxfuel.com/preview/996/949/73/light-house-tower-cape-reinga-new.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Perched at the northernmost tip of New Zealand's North Island, Cape Reinga Lighthouse offers a mesmerizing coastal experience. This iconic landmark holds cultural significance as the place where the Tasman Sea and Pacific Ocean meet, according to Māori mythology. Visitors can enjoy breathtaking panoramic views of the rugged coastline, witness the powerful clash of the two oceans, and marvel at the expansive sand dunes that stretch toward the horizon. The lighthouse itself serves as a navigational beacon and provides a glimpse into the maritime history of the region. Cape Reinga Lighthouse is not only a scenic marvel but also a place of spiritual significance, making it a must-visit destination for those exploring the northernmost reaches of New Zealand.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 84,
            "title": "Giant Sand Dunes",
            "location": "Cape Reinga, Northland",
            "coords": [172.795111, -34.507877],
            "rating": 7.5,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/c/c1/Te_Paki_sand_Dunes._%2820063513918%29.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Located in Te Paki Recreation Reserve, the Giant Sand Dunes are a natural wonder and a playground for adventure seekers. These towering sand dunes, formed by the prevailing winds, create a surreal landscape that stretches for kilometers. Visitors can experience the thrill of sandboarding or tobogganing down the steep slopes, feeling the rush of adrenaline as they glide over the fine golden sand. The dunes also offer incredible photo opportunities, especially during sunrise or sunset when the shifting light enhances the dramatic beauty of the landscape. Whether you're seeking an exhilarating adventure or simply want to immerse yourself in the awe-inspiring natural surroundings, the Giant Sand Dunes are a unique attraction that showcases the diverse landscapes of New Zealand.",
            "categories": ["North Island", "Activity", "Landmark"]
        },
        {
            "id": 85,
            "title": "Ninety Mile Beach",
            "location": "Northland",
            "coords": [172.75715373707948,-34.5489830392998],
            "rating": 2.5,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/a/af/Ninety_Mile_Beach_looking_south.jpg",
            "imageAlt": "",
            "price": 0,
            "description": "Stretching along the western coast of Northland, Ninety Mile Beach is a spectacular and expansive stretch of coastline that captivates visitors with its beauty and sense of vastness. Despite its name, the beach is actually 88 kilometers (55 miles) long, providing ample space for relaxation, exploration, and outdoor activities. Take a refreshing dip in the turquoise waters, stroll along the seemingly endless sandy shore, or try your hand at surfcasting and catch a fish for dinner. The beach is also a designated highway, allowing for a unique driving experience with the waves crashing nearby. As you explore Ninety Mile Beach, be sure to keep an eye out for the famous Te Paki Stream, where adventurous drivers can experience the thrill of driving through the shallow waters. Ninety Mile Beach is a true natural wonder that showcases the raw beauty and tranquility of New Zealand's coastline.",
            "categories": ["North Island", "Landmark"]
        },
        {
            "id": 86,
            "title": "Kauri Coast Top 10 Holiday Park",
            "location": "Kauri Coast, Northland",
            "coords": [173.674429, -35.750035],
            "rating": 5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 24,
            "description": "Situated in the heart of Northland, Kauri Coast Top 10 Holiday Park offers a convenient and comfortable base for exploring the region's attractions. The holiday park provides a range of accommodation options, including cabins, self-contained units, and camping sites. Kauri Coast itself is a vibrant town known for its rich history, charming art galleries, and proximity to natural wonders. Visitors can delve into the area's past at the Kauri Coast Museum, which showcases artifacts and stories from the region's pioneering days. Explore the nearby Trounson Kauri Park, home to majestic kauri trees, or embark on a scenic drive to the picturesque Kai Iwi Lakes. Kauri Coast Top 10 Holiday Park offers a peaceful retreat and a gateway to the treasures of Northland.",
            "categories": ["North Island", "Accommodation"]
        },
        {
            "id": 87,
            "title": "Auckland Airport Ibis Budget Hotel",
            "location": "Auckland, Auckland",
            "coords": [174.789134, -36.998508],
            "rating": 8.5,
            "imageUrl": "img/Placeholder_Accommodation.png",
            "imageAlt": "",
            "price": 64.75,
            "description": "Conveniently located near Auckland Airport, the ibis Budget Hotel provides comfortable and affordable accommodation for travelers. Whether you're arriving in Auckland or catching an early flight, this hotel offers a convenient overnight stay option. The hotel's rooms are clean, modern, and well-equipped, ensuring a comfortable rest. With 24-hour reception and a complimentary airport shuttle service, the ibis Budget Hotel provides convenience and accessibility. Although it primarily serves as a transit hotel, it also offers easy access to nearby attractions, shopping centers, and dining options. Whether you're a business traveler, a tourist on a layover, or simply seeking a comfortable place to rest, the Auckland Airport ibis Budget Hotel provides a practical and budget-friendly choice.",
            "categories": ["North Island", "Accommodation"]
        }    
    ]
}